---
kind: property
id: P:Autodesk.Revit.DB.ConnectorManager.Connectors
source: html/ddefb4b0-881a-bb7a-6824-c610ac2d293b.htm
---
# Autodesk.Revit.DB.ConnectorManager.Connectors Property

Return all the Connectors of the Connector Manager.

## Syntax (C#)
```csharp
public ConnectorSet Connectors { get; }
```

## Remarks
This property is used to retrieve the Connectors from the Connector Manager.